In [2]:
import pandas as pd
# create a more complex dataframe
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie', 'David'],
                           'Age': [25, 30, 35, 40],
                           'Gender': ['F', 'M', 'M', 'M'],
                           'City': ['New York', 'London', 'Paris', 'Tokyo'],
                           'Salary': [50000, 60000, 70000, 80000]})
df

      Name  Age Gender      City  Salary
0    Alice   25      F  New York   50000
1      Bob   30      M    London   60000
2  Charlie   35      M     Paris   70000
3    David   40      M     Tokyo   80000

In [5]:
sorted_age = df.sort_values(by='Age', ascending=False)
sorted_age

      Name  Age Gender      City  Salary
3    David   40      M     Tokyo   80000
2  Charlie   35      M     Paris   70000
1      Bob   30      M    London   60000
0    Alice   25      F  New York   50000

In [8]:
mean_salary = df['Salary'].mean()
show_above_avg_sal = df[df['Salary'] >= mean_salary]
show_above_avg_sal

      Name  Age Gender   City  Salary
2  Charlie   35      M  Paris   70000
3    David   40      M  Tokyo   80000